[{"id":"132","idx":"117","uid":"","insert_ip":"","date":"1444852260","expiredate":"1445025060","module_idx":"2","type":"","title":"Freedom of Speech","picture":"","hscode":"","sector_id":"","sub_sector_id":"","products":"","shelf_life":"","packaging":"","awards":"","event_desc":"","event_when":"","event_fee":"","event_website":"","videourl":"","short_description":"<p>All of our governments of various periods in the last twenty-five years have been at a loss when it came to the relationships<\/p>","long_description":"<p><img style=\"text-align: left;\" src=\"http:\/\/www.georgianjournal.ge\/pictures\/image2\/40885ea6d190852c804203b0910f6ee2.jpg\" alt=\"\" width=\"283\" height=\"279\" \/>&nbsp;<strong>All of our governments of various periods in the last twenty-five years have been at a loss when it came to the relationships<\/strong> <strong>with media because media forms itself much quicker as a democratic institution than governments in general.<\/strong><br \/>The Human Rights theme is not my bread-and-butter in life, but I know by heart the entire text of the Bill of Rights and, frankly, I have developed a taste for human freedoms as such from that most read, cherished and celebrated political document in the history of mankind. Nothing is sweeter and more important for us the humans than freedom to speak our mind. It is the most pivotal freedom for Homo sapiens. The rest of the freedoms are based on this particular freedom &ndash; the freedom of expression. If you are deprived of a chance to speak out, slavery is guaranteed, and the only thing that can help to get back into normal human existence is again the freedom of speech. The American constitution went into force in 1789, and all of a sudden, it became known that the human rights were not specified in the text of the country&rsquo;s major governing blueprint. The lacking significant part of the main law of the land was immediately added to the text in the form of amendments &ndash; the first ten amendments to the Constitution of the United States of America. The very first one out of these ten amendments says that no law or act by government may abridge the freedom of speech or of the press. The Georgian constitution emphasizes the same human right, based on the same human value, based on the same human ideal. Formally! In reality, we are right in the middle &ndash; if not at the beginning &ndash; of the road, propelling us towards the model of societal structure which honors the so called human rights to the utmost. But we are working on it! Our society is changing to a certain extent albeit very slowly. Starting from the very moment of grabbing the latest chance of political independence as a result of the soviet collapse about a quarter of a century ago, our political behavior is under permanentimprovement and reconstruction. We have been diligently trying to acquire the glossy western fa&ccedil;ade, thus paving the way towards European structures and institutions as well as American strategic partnership for feeling better in terms of internal<\/p>\r\n<p>tranquility and international security. But not always we manage to reach the successful end. And the reasons for our failures are amply detectable. One of the most noticeable for both the foreign and the domestic eye happens to be the attitude of Georgian administrations of various times towards the media of mass communication, especially the TV broadcasting, which often becomes the victim of the angered governmental powers. The classical knowledge of PR and journalism is prompting the governments of the world to be careful with a written and broadcast word because they have the ability to stir the minds and move the hearts of those masses, by which the rulers of the nations are usually elected and reelected, or brought down and trashed like historical waste. In most cases, this axiomatic philosophy of interaction between media and government is alive and working. Moreover, this is the proverbial truth which most of the countries are no longer ignoring because they know exactly what kind of &lsquo;rascals&rsquo; they are having to do in the person of the ladies and gentlemen of the press. The government officials are often trained on a very high level for their skill of handling media. Media needs to be treated fairly and correctly because media is today powerful, educated, informed and adroit, and they know well how to handle governments, and do this with absolute professional precision. Do we know this much in Georgia? I doubt! Here, the media-governmental mutual exacerbation is a commonplace thing. We have seen in this country the officially authorized armed-to-the-teeth minions of law taking over TV stations right in the middle of their presence on the air. We have seen the broadcasting media going off the air due to their persistent anti-administration commentary. We have lately been witnessing the disappearance from the air of several TV talk-shows because they would feed to public the flaws of the government rather than its merits. We have also observed the attempt of severe financial debilitation of a critically-poised TV station which usually enjoys the outstanding rating in the market. These are the facts that defy the effective functionality of democratic institutions in favor of our society, and make our chances thinner for perpetuation of freedom of speech in Georgia. We are a new, inexperienced political culture, therefore our political stance might sooner be hostile than amicable towards politically crucial institutions like means of mass communication. All of our governments of various periods in the last twenty-five years have been at a loss when it came to the relationships with media because media forms itself much quicker as a democratic institution than governments in general. Governments take longer to reconcile themselves with freedom of speech &ndash; one of the most significant components of democracy, especially if the new democracy is coming from the rigid depths of long-standing social order of communistic make. Governments need to be prompted so that they discern better between the good and the evil. If our government is one of those who needs that kind of a prompter, this editorial might very well qualify as one, the main message of which is not to fight media but to remember once and for all: If you cannot beat them, join them!<\/p>","admin_com":"","tags":"","slug":"about-us\/news\/Freedom-of-Speech","insert_admin":"1","position":"0","lang":"5","visibility":"2","status":"0"},{"id":"131","idx":"116","uid":"","insert_ip":"","date":"1444764000","expiredate":"1445023200","module_idx":"2","type":"","title":"Georgia: rise and shine - Kazbegi from a foreigner's eye","picture":"","hscode":"","sector_id":"","sub_sector_id":"","products":"","shelf_life":"","packaging":"","awards":"","event_desc":"","event_when":"","event_fee":"","event_website":"","videourl":"","short_description":"<p>Georgia&rsquo;s highland town Kazbegi located in the north-eastern part of the country has fascinated<\/p>","long_description":"<p><img style=\"margin-bottom: 10px;\" src=\"http:\/\/www.georgianjournal.ge\/pictures\/image2\/101a341c90c6a3d96115591e7614ac09.jpg\" alt=\"\" width=\"100%\" \/><\/p>\r\n<p>Georgia&rsquo;s highland town Kazbegi located in the north-eastern part of the country has fascinated and left many foreigner visitors speechless for centuries. Great Russian poet Alexander Pushkin impressed with its beauty even dedicated a rhyme to the 14th century Gergeti Trinity Church standing under famous Mount Kazbegi. <br \/><br \/>This historical part of Georgia has flourished and attracted more and more tourists&nbsp;as the years passed by.<br \/><br \/><a href=\"http:\/\/www.cntraveller.com\/recommended\/coast-countryside\/design-hotels-georgia\" target=\"_blank\">Cntraveller.com <\/a>has published an article by Jonathan Bastable who got to know Georgia when it was a sleepy Soviet republic and after returning for the first time since independence, he found it more lively, modern and eye-catching. <br \/><br \/>Here is what the foreign traveler writes about Kazbegi, its beautiful landscape and a new hotel located there:<br \/><br \/>&ldquo;In the highlands of Kazbegi, mornings are the best time of day. The Russian poet Boris Pasternak, who loved the Caucasus, compared this rocky part of Georgia to a 'great rumpled bed'. And it is quite a thing to wake up at cock's crow and, from the comfort of your own rumpled bed, to look out across the valley to the lonely Church of the Trinity on the nearest peak. The distant chapel has the distinctively Georgian spire: an inverted cone, like the upturned tip of a brand-new crayon. The adjacent bell tower has the same pointed lid on it, and together they look like salt and pepper pots placed on a flowing green tablecloth.<br \/><br \/>The Caucasian uplands are craggier, more flinty than the Alps or Pyrenees. Their pikes and ridges are as sharp and dangerous as the blade of a shashka - the 'long knife' wielded by the Circassian tribesmen who once populated this country. The mountains are so tightly packed they seem to be jostling for space. The taller ones stand at the back, like children in a class photo - and, like some schoolchildren, they often have their heads in the clouds. Ah, but when those clouds part and the summit of Mount Kazbek appears, you know why this part of the world so captivates visitors, and why Georgians insist that their homeland is a God-given corner of paradise. Kazbek at dawn is a superb sight: a soaring white crest that (it has been said) resembles a cardinal's hat. When the risen sun shines directly on its snowy east face, the mountain blazes like a searchlight, and is almost too bright to look at.<\/p>","admin_com":"","tags":"","slug":"about-us\/news\/Georgia-rise-and-shine---Kazbegi-from-a-foreigners-eye","insert_admin":"1","position":"0","lang":"5","visibility":"2","status":"0"},{"id":"130","idx":"115","uid":"","insert_ip":"","date":"1444758240","expiredate":"1445017440","module_idx":"2","type":"","title":"October declared a Georgian Wine Month in the U.S.","picture":"","hscode":"","sector_id":"","sub_sector_id":"","products":"","shelf_life":"","packaging":"","awards":"","event_desc":"","event_when":"","event_fee":"","event_website":"","videourl":"","short_description":"<p>The Georgian Wine Month has started in the USA. The event began in New York, by sampling Georgian wine.<\/p>","long_description":"<p><img style=\"margin-bottom: 10px;\" src=\"http:\/\/www.georgianjournal.ge\/pictures\/image2\/1e8b45e0b95bf4b54a711b0ca42e6995.jpg\" alt=\"\" width=\"100%\" \/><\/p>\r\n<p>The Georgian Wine Month has started in the USA. The event began in New York, by sampling Georgian wine. It was conducted by an American company Tastingwork, the members of the Georgian Wine Agency and its head, Lisa Granik. <br \/><br \/>The participants of the degustation were 22 companies. They presented traditional wines as well as wines that were made using European methods. In the framework of this event, the workshop was held, concerning the history of Georgian wine. It was conducted by a wine magister, Lisa Granik.<\/p>","admin_com":"","tags":"","slug":"about-us\/news\/October-declared-a-Georgian-Wine-Month-in-the-US","insert_admin":"1","position":"0","lang":"5","visibility":"2","status":"0"},{"id":"129","idx":"114","uid":"","insert_ip":"","date":"1444757580","expiredate":"1445016780","module_idx":"2","type":"","title":"Manliness overload! – How Georgian rugby players prepare for the victories (Video)","picture":"","hscode":"","sector_id":"","sub_sector_id":"","products":"","shelf_life":"","packaging":"","awards":"","event_desc":"","event_when":"","event_fee":"","event_website":"","videourl":"","short_description":"<p>Now as the group stage of Rugby World Cup 2015 has ended and Georgian National Team has more than achieved<\/p>","long_description":"<p>Now as the group stage of Rugby World Cup 2015 has ended and Georgian National Team has more than achieved its main goal, let us remember how The Lelos were preparing for the championship. This video was uploaded to the Georgian Rugby Union Facebook page and it shows how selflessly Georgian players practice to meet all the requirements of the World Cup. <br \/><br \/>Camera man: Vakho Chikvaidze; Editor: Lasha Lortkipanidze<br \/><br \/><a href=\"http:\/\/video.ambebi.ge\/files-3\/2015\/10-13\/georgian-rugby-union-official1qtp.mp4\" target=\"_blank\">Video<\/a><\/p>","admin_com":"","tags":"","slug":"about-us\/news\/Manliness-overload--How-Georgian-rugby-players-prepare-for-the-victories-Video","insert_admin":"1","position":"0","lang":"5","visibility":"2","status":"0"},{"id":"128","idx":"113","uid":"","insert_ip":"","date":"1444671000","expiredate":"1445016600","module_idx":"2","type":"","title":"“This truly is moving” - Ashton Kutcher comments about Batumi’s Ali and Nino statue","picture":"","hscode":"","sector_id":"","sub_sector_id":"","products":"","shelf_life":"","packaging":"","awards":"","event_desc":"","event_when":"","event_fee":"","event_website":"","videourl":"","short_description":"<div class=\"blog_text\">The well-known Hollywood actor, Ashton Kutcher, made a comment about one of Georgia&rsquo;s landmarks<\/div>\r\n<p>&nbsp;<\/p>","long_description":"<p><img style=\"margin-bottom: 10px;\" src=\"http:\/\/www.georgianjournal.ge\/pictures\/image2\/20bb93965803f9e2050532e451ade6e3.jpg\" alt=\"\" width=\"100%\" \/><\/p>\r\n<p>The well-known Hollywood actor, Ashton Kutcher, made a comment about one of Georgia&rsquo;s landmarks , the statue of Ali and Nino. &lsquo;This truly is moving,&rdquo; wrote Kutcher on his Facebook page about the animated statue that was installed in the coastal city of Batumi in 2011.<br \/><br \/>Ali and Nino was damaged a few months ago, during its relocation. Namely, Nino&rsquo;s statue fell from the crane. However, Batumi&rsquo;s trademark was quickly restored and installed at a new place, close to the observation wheel, where the heavy storms will not threaten it. <br \/><br \/>This 8-meter-tall moving monument, which symbolizes unending love and unity between two nations, has become one of the city's symbols. It was made by a Georgian artist and sculptor Tamar Kvesitadze, modeled after two main characters of Azerbaijani writer Kurban Said's novel of the same name. Many say that it also symbolizes a connection between Europe and Asia.<br \/><br \/>As for the <a href=\"http:\/\/aplus.com\/a\/tamara-kvesitadze-ali-and-nino-georgia-batumi-sculpture?c=3156&amp;utm_campaign=i102&amp;utm_source=a88554\" target=\"_blank\"><strong>article <\/strong><\/a>shared<\/p>\r\n<div class=\"article_ads\">&nbsp;<\/div>\r\n<p>by Ashton Kutcher via his facebook page, it was published by aplus.com website, whose founder is Kutcher himself. \"There have been many great love stories in the history of mankind &mdash; from Adam and Eve, to Romeo and Juliet, to John Lennon and Yoko Ono, to your neighbor and that Tinder guy she's been dating for the past couple of months. But here's a love story you probably haven't heard: Ali and Nino,\" the article reads. <br \/><br \/>The post gave rise to the positive reaction from his friends and fans. They write that this statue is located in Georgia and that Ashton should consider seeing it.<\/p>","admin_com":"","tags":"","slug":"about-us\/news\/This-truly-is-moving---Ashton-Kutcher-comments-about-Batumis-Ali-and-Nino-statue","insert_admin":"1","position":"0","lang":"5","visibility":"2","status":"0"},{"id":"127","idx":"112","uid":"","insert_ip":"","date":"1444584240","expiredate":"1445016240","module_idx":"2","type":"","title":"Accidentally Discovering Georgia: An American Photographer Happily Lost in Svaneti","picture":"","hscode":"","sector_id":"","sub_sector_id":"","products":"","shelf_life":"","packaging":"","awards":"","event_desc":"","event_when":"","event_fee":"","event_website":"","videourl":"","short_description":"<p>Robert Cooper is an American photojournalist from Texas. He has resided in Tbilisi for the last year.<\/p>","long_description":"<p><img style=\"margin-bottom: 10px;\" src=\"http:\/\/www.georgianjournal.ge\/pictures\/image2\/1417a091178762af8917195c9c348def.jpg\" alt=\"\" width=\"100%\" \/><\/p>\r\n<p>Robert Cooper is an American photojournalist from Texas. He has resided in Tbilisi for the last year. <br \/><br \/><em><strong>These images capture some of my experience in Mestia, Ushguli, Iprari, and Adishi. Svaneti and the area around Kazbegi offer some of the more beautiful views in Georgia. There&rsquo;s no shortage of photo opportunities in either region.<\/strong><\/em><\/p>\r\n<p><em>I purchased my ticket to Kutaisi when I was in Vilnius, Lithuania. It wasn&rsquo;t a planned trip and I bought the Wizz air ticket with cash at the airport the morning of the flight. I knew very little about Georgia &ndash; so little that I assumed that I was flying into Tbilisi. <em><br \/>Go through the gallery:<\/em><\/em><\/p>","admin_com":"","tags":"","slug":"about-us\/news\/Accidentally-Discovering-Georgia-An-American-Photographer-Happily-Lost-in-Svaneti","insert_admin":"1","position":"0","lang":"5","visibility":"2","status":"0"},{"id":"126","idx":"111","uid":"","insert_ip":"","date":"1444496880","expiredate":"1445015280","module_idx":"2","type":"","title":"Ankara explosion: Blasts hit rally in Turkish capital","picture":"","hscode":"","sector_id":"","sub_sector_id":"","products":"","shelf_life":"","packaging":"","awards":"","event_desc":"","event_when":"","event_fee":"","event_website":"","videourl":"","short_description":"<p>Two explosions have hit a peace rally in the Turkish capital Ankara, causing multiple casualties, reports say.<\/p>","long_description":"<p><img style=\"margin-bottom: 20px;\" src=\"http:\/\/www.georgianjournal.ge\/pictures\/image2\/acd4e49cd66f6de03d25d53a7a5f2724.jpg\" alt=\"\" width=\"100%\" \/><\/p>\r\n<p>Two explosions have hit a peace rally in the Turkish capital Ankara, causing multiple casualties, reports say. <br \/>Turkish news agency Dogan said that at least 20 people have been killed. TV footage shows scenes of panic and people lying on the ground covered in blood, amid protest banners, BBC reports. <br \/>The blasts took place near the city's central train station.<br \/>The target appears to have been a march calling for an end to the violence with the Kurdish separatist group, the PKK.<br \/>Prime Minister Ahmet Davutoglu is being briefed by the interior and health ministers, state news agency Anadolu says.<br \/>Government officials say the blasts were a terrorist attack and are investigating reports that a suicide bomber was behind at least one of the explosions.<br \/>The leader of the pro-Kurdish HDP party has blamed the state for the attack, and cancelled all election rallies.<br \/>The HDP was among those calling for Saturday's rally for \"peace and<\/p>\r\n<div class=\"article_ads\">&nbsp;<\/div>\r\n<p>democracy\", which was due to start at 12:00 local time.<br \/>The party tweeted that there were \"numerous dead and injured\", and that police \"attacked\" people carrying the injured away, BBC informs. <br \/>Local resident Emre told the BBC that he heard two separate explosions and saw a number of dead bodies. Angry people tried to attack police cars, he said.<br \/>An HDP rally in the city of Diyarbakir was bombed in June, ahead of general elections.<br \/>Turkey is holding another election next month, and the BBC's Mark Lowen in Istanbul says it was feared that another similar attack was imminent.<\/p>","admin_com":"","tags":"","slug":"about-us\/news\/Ankara-explosion-Blasts-hit-rally-in-Turkish-capital","insert_admin":"1","position":"0","lang":"5","visibility":"2","status":"0"},{"id":"125","idx":"110","uid":"","insert_ip":"","date":"1444410000","expiredate":"1445014800","module_idx":"2","type":"","title":"Rustavi 2: The Saga Continues","picture":"","hscode":"","sector_id":"","sub_sector_id":"","products":"","shelf_life":"","packaging":"","awards":"","event_desc":"","event_when":"","event_fee":"","event_website":"","videourl":"","short_description":"<p>Will the events around Rustavi 2 mark the beginning of the ruling party&rsquo;s end?<\/p>","long_description":"<p><img style=\"margin-bottom: 10px;\" src=\"http:\/\/www.georgianjournal.ge\/pictures\/image2\/c08fbcfb9551e283948e91992f97e322.jpg\" alt=\"\" width=\"100%\" \/><\/p>\r\n<p><strong>Will the events around Rustavi 2 mark the beginning of the ruling party&rsquo;s end?<\/strong> <br \/><br \/>&ldquo;With their decision, the authorities have closed down Rustavi 2.&rdquo; This is what the Director General of the TV Company, Nika Gvaramia said during an extraordinary press-conference, after it was reported that the Sakartvelo TV Company which owns 51 percent of Rustavi 2 shares, was arrested. Gvaramia also said that the Public Registry office intentionally delayed the registration of USD 6 million, which was raised by the company. He also made no secret that those 6 million dollars were to be invested by the former Defense Minister, Davit Kezerashvili&rsquo;s relative, Demetre Chiqovani. But as the lawyers of Kibar Khalvashi say, they addressed the court because Rustavi 2 was planning to sell the majority of its shares to another enterprise and that would mean changing of the biggest shareholder. Kibar Khalvashi claims that during the previous government, Rustavi 2 was illegitimately confiscated from him. A few weeks ago, by Khalvashi&rsquo;s request, the court arrested the property of Rustavi 2. <br \/><br \/><em><strong>The director general of the TV Company, Nika Gvaramia says that the processes are tied to the upcoming parliamentary elections. For former Prime Minister Bidzina Ivanishvili the independent media is totally unacceptable, especially during the pre-election period, he claims. Gvaramia hopes society will stand by the freedom of speech and calls for financial help. <\/strong><\/em><\/p>\r\n<p>&nbsp;<\/p>\r\n<p><em><img style=\"text-align: right;\" src=\"http:\/\/www.georgianjournal.ge\/images\/GJ\/2015\/40\/kvesitadze.jpg\" alt=\"\" width=\"350\" height=\"263\" \/>Gvaramia says the processes are tied to the upcoming parliamentary elections. For former Prime Minister Bidzina Ivanishvili the independent media is totally unacceptable, especially during the pre-election period, he claims. Gvaramia hopes society will stand by the freedom of speech and calls for financial help. <br \/>Somehow, the political environment in the country has always directly reflected on Rustavi 2. The company changed its owner twice and one of them was Kibar Khalvashi, a businessman with a not quite agreeable reputation. He was friends with the former Prosceutor General and former Defense Minister, Irakli Okruashvili. Later, Rustavi 2 was passed on to the Karamanashvili brothers. Some say, one of them was then-President Mikheil Saakashvili&rsquo;s close friend and trusted man. <br \/><br \/>Inarguably, a few years ago, Kibar Khalvashi was an instrument in the hands of the National Movement, to keep control over Rustavi 2. Accordingly, there is a possibility of him being the same kind of instrument today, this time in the hands of the current authorities.<\/em><\/p>\r\n<p><em>Inarguably, a few years ago, Kibar Khalvashi was an instrument in the hands of the National Movement, to keep control over Rustavi 2. Accordingly, there is a possibility of him being the same kind of instrument today, this time in the hands of the current authorities.<\/em><\/p>\r\n<p><em>The whole picture becomes even more aggravated if we remember that the case of Erosi Kitsmarishvili&rsquo;s sudden death is still not investigated. Kitsmarishvili was a founder of Rustavi 2 and the parliamentary opposition thinks his bizarre demise is tied with the current government&rsquo;s plans to appropriate Rustavi 2.<\/em><\/p>\r\n<p><img style=\"text-align: left;\" src=\"http:\/\/www.georgianjournal.ge\/images\/GJ\/2015\/40\/gvaramia-pk.jpg\" alt=\"\" width=\"300\" height=\"171\" \/>What is the free media, after all? In my opinion, it is when the members of society are able to receive information from different sources and to draw conclusions by themselves. On the other hand, I also agree that the media is not only the fourth estate. It is also an important instrument that can form public opinion. As they say in Georgia, this often looks very much like brainwashing. However, all the members of our society have to agree, that the free and diverse media, be it a newspaper or a broadcaster, whether biased or professionally accomplished, is a precondition of democracy. And the democratic state is the fundamental condition that will ensure our transition from the post-soviet slump to the free society. Before our authorities realize that, the parliamentary opposition has already announced mass protests in support of Rustavi 2. The situation was worsened when the three participants of the rally were detained by the police. The reason was that they physically abused one of the Parliament Members, Davit Lortkipanidze and damaged his jacket. They are now in pretrial detention and may face 7 years in prison if found guilty. So, with the situation being what it is, the parliamentary opposition has announced the beginning of the current government&rsquo;s end.<\/p>\r\n<p>&nbsp;<\/p>\r\n<p>&nbsp;<\/p>","admin_com":"","tags":"","slug":"about-us\/news\/Rustavi-2-The-Saga-Continues","insert_admin":"1","position":"0","lang":"5","visibility":"2","status":"0"},{"id":"124","idx":"109","uid":"","insert_ip":"","date":"1444409640","expiredate":"1445014440","module_idx":"2","type":"","title":"The Man Who Thinks With His Fingers","picture":"","hscode":"","sector_id":"","sub_sector_id":"","products":"","shelf_life":"","packaging":"","awards":"","event_desc":"","event_when":"","event_fee":"","event_website":"","videourl":"","short_description":"<p>According to the self-taught sculptor Levan Bujiashvili, he thinks with his fingers, and his work fully reflects this.<\/p>","long_description":"<p>According to the self-taught sculptor Levan Bujiashvili, he thinks with his fingers, and his work fully reflects this. It also seems that Mr. Bujiashvili ran out of space to display his sculptures, and this is why they are scattered all over Tbilisi and other Georgian cities. When walking down Rustaveli Avenue in particular, it is hard to miss tourists and locals alike posing for photos with Bujiashvili&rsquo;s statues. Some want to get acquainted with the artist who created them, but few actually follow through with that desire. Luckily,<em>Georgian Journal<\/em> did. We invited the prolific sculptor for an interview, and here is what he had to say:<br \/><br \/><em><strong>&ldquo;It only takes one touch to feel what I can make from a stone.&rdquo;<\/strong><\/em><br \/><br \/>&ndash; The results of my work are there for all to see. I think that these sculptures have contributed their share of&nbsp;positivity to the capital&rsquo;s main boulevard. I am not so fond walking through it myself, but some time ago I had to do so. And to be honest, I found seeing tourists pose with my sculptures to be quite pleasant. Children also seemed to be very fond of them.<br \/><br \/><strong>&ndash; How much of your work decorates Rustaveli Avenue, exactly?<\/strong><br \/><br \/>&ndash; Initially there were 50 pieces in total, but later some of them got stolen. Now only 42 remain. When I created these sculptures, I named them after my friends and also put down my own name. Since then, many people have sought me out. I can therefore proudly say that a large share of my success is owed precisely to the fact that my work decorates the country&rsquo;s main avenue. It was a correct step for me to make.<br \/><br \/>Also, another place with my sculptures is the Artists&rsquo; Bar near Tbilisi&rsquo;s Dry Bridge.<\/p>\r\n<p><strong>&ndash; Another favorite tourist spot, is it not?<\/strong><\/p>\r\n<p><strong><img style=\"text-align: left;\" src=\"http:\/\/www.georgianjournal.ge\/images\/GJ\/2015\/40\/erti%20kargi%20adamianis%20ezo.jpg\" alt=\"\" width=\"250\" height=\"188\" \/>&nbsp;&ndash; Yes! There stands my &ldquo;Unknown Artist&rsquo;s Sculpture.&rdquo; I tried to keep the scale natural when creating it. It was made specifically for tourists to be photographed with, and the concept worked. The place was chosen strategically, and the sculpture fits the overall theme.<br \/><br \/>Another one of my works, composed of 21 pieces, stands in Rustavi. Gori and Zestafoni also have several. When choosing my next creation for a city, I always pay attention to whether it would be acceptable for children; if there are no complaints from them, I take it as a step in the right direction.<br \/><br \/><em><strong>&ldquo;I<\/strong><\/em><\/strong><strong><em><strong>made a family of stone turtles and added a few bottles of mineral water to the composition to specify their origin.&rdquo;<\/strong><\/em><br \/><br \/><strong>&ndash; Do you have a muse that inspires you?<\/strong><br \/><br \/>&ndash; Sometimes I invent a muse: When I like a person, I pretend that this person is immaculate and flawless. This does not happen in real life, though. Others have their own lives and I have mine. But if they leave a trace in my thoughts, they become beautifully reflected in my art. I never had an inspiring muse in the classic sense. Here is how my mind works: I am happy when I&rsquo;m busy with my art; everything else revolves around it. I also do not trust alcohol to help me with my work &ndash; all of my sculptures were created when I was fully sober. For me, drinking is associated with something completely different. I do not know whether it is a good or a bad thing.<br \/><br \/><strong>&ndash; Have you ever had to redo any of your works?<\/strong><br \/><br \/>&ndash; Of course, especially when working with bronze. Since I do not have a classical education, I frequently have to rework things. I can redo a sculpture a thousand times, as long as I get the necessary result, and this process does not cause me any discomfort. <br \/><br \/>The bigger the sculpture the more interesting it is to work with it. As for materials, aside from wood, I work with bronze, copper and burnished metal. For example, when taking a walk along a riverbank, I look at stones and think, &ldquo;I can make something from this one or that one.&rdquo; It only takes one touch to feel what I can make from a stone. Just like that, I think with my fingers. <\/strong><\/p>\r\n<p><strong>&ndash; In what countries besides Georgia can one encounter your work?<br \/><br \/>&ndash; Just recently I was at a symposium in Baku. It was a meeting of sculptors from all over the world who made their sculptures from used items. I was the only one invited from Georgia. The symposium was supported by Mehriban Aliyeva and opene<img style=\"text-align: right;\" title=\"The Man Who Thinks With His Fingers\" src=\"http:\/\/www.georgianjournal.ge\/images\/GJ\/2015\/40\/baqo-kuebis%20ojaxi.jpg\" alt=\"geotv.ge\" width=\"424\" border=\"0\" \/>d by her daughter. The work that I brought with me was met with appreciation. I made a family of stone turtles and added a few bottles of mineral water to the composition to specify their origin. Today this family decorates one of Baku&rsquo;s oldest districts. <br \/><br \/>Also, in the old part of Lithuania&rsquo;s capital, Vilnius, there is a spot where artists like to gather. It is decorated by my &ldquo;flamingo.&rdquo;<br \/><br \/>By the way, in the near future there will be another one of my pieces, featuring ballerinas, added to Tbilisi. But I won&rsquo;t tell you where it will be located. You&rsquo;ll have to find that out for yourself in a month.<\/strong><\/p>","admin_com":"","tags":"","slug":"about-us\/news\/The-Man-Who-Thinks-With-His-Fingers","insert_admin":"1","position":"0","lang":"5","visibility":"2","status":"0"},{"id":"123","idx":"108","uid":"","insert_ip":"","date":"1444409460","expiredate":"1445014260","module_idx":"2","type":"","title":"The 10 Dishes That Will Make You Fall in Love With Georgian Food","picture":"","hscode":"","sector_id":"","sub_sector_id":"","products":"","shelf_life":"","packaging":"","awards":"","event_desc":"","event_when":"","event_fee":"","event_website":"","videourl":"","short_description":"<p>When you arrive in Tbilisi, border agents don't just stamp your passport;<\/p>","long_description":"<p>When you arrive in Tbilisi, border agents don't just stamp your passport; they hand you a bottle of wine. It's a fitting welcome to Georgia, a mountainous country sandwiched between Europe and Asia, where dinner guests are exalted as \"gifts from God\" and traditional feasts called supras unfold in biblical proportions, sometimes lasting for days on end, seriouseats.com website reports. <br \/><br \/>It's easy to lose track of time at the Georgian table. On a recent visit to the country's capital, I joined some friends for a dinner that entailed a dizzying array of salads, followed by steaming vats of heady stews and braises, gallons of orange wine, and occasional forays into polyphonic harmony, a signature feature of Georgian folk music. Staggering back to my hotel at 4 a.m., stuffed and delirious, I felt like I had emerged from a culinary fever dream. <br \/><br \/>The good news is, you no longer have to board a flight to the Caucasus to have a supra. In New York City alone, five Georgian restaurants have sprung up in the last three years. Georgia's distinctive orange wine, once known to only the savviest sommeliers, is now cropping up on wine lists across the country (some are even dubbing it the new ros&eacute;). And for DIYers, there's Darra Goldstein's encyclopedic, unrivaled cookbook, The Georgian Feast, newly released in second edition.<\/p>","admin_com":"","tags":"","slug":"about-us\/news\/The-10-Dishes-That-Will-Make-You-Fall-in-Love-With-Georgian-Food","insert_admin":"1","position":"0","lang":"5","visibility":"2","status":"0"},{"id":"122","idx":"107","uid":"","insert_ip":"","date":"1444320720","expiredate":"1445011920","module_idx":"2","type":"","title":"The Mountain Resorts of Georgia Prepare for Winter’s Hot Season!","picture":"","hscode":"","sector_id":"","sub_sector_id":"","products":"","shelf_life":"","packaging":"","awards":"","event_desc":"","event_when":"","event_fee":"","event_website":"","videourl":"","short_description":"<p>The mountains of Georgia are becoming more and more attractive for foreign tourists as well as for the local population.<\/p>","long_description":"<p>The mountains of Georgia are becoming more and more attractive for foreign tourists as well as for the local population. One can find articles about Gudauri, Bakuriani and other Georgian winter resorts in the foreign press and the aim of those articles is to attract more people. That is why the Ministry of Economy and Sustainable Development of Georgia, Ltd. &ldquo;Mountain Resorts Development Company&rdquo; are already actively involved in the preparation process. Their work area includes the Gudauri, Bakuriani (Didveli, Kokhta, Mitarbi) and Goderdzi ski resorts. For the places to be ready for tourists, several projects are underway. Currently, on the Kokhta and Mitarbi mountains, new ski lifts are being installed, which will contribute to the further development of ski tourism in the historical Georgian resort.<\/p>\r\n<p>&nbsp;<\/p>\r\n<p><img style=\"text-align: left;\" src=\"http:\/\/www.georgianjournal.ge\/images\/GJ\/2015\/40\/logo%20-%20eng.jpg\" alt=\"\" width=\"250\" height=\"175\" \/>&nbsp;On Kokhta Mountain, the new ski lift will have an intermediate station. The construction will be completed in December 2015. New touristic infrastructure for 500 persons will be built in the surrounding area &ndash; hotels, aparthotels, cottages, restaurants and leisure facilities.<br \/><br \/>On Mitarbi Mountain, two new ski lifts and one platter lift will be installed. Construction will be completed by the end of 2016. New infrastructure for 300 persons will be built in the surrounding area &ndash; hotels, aparthotels, cottages, restaurants and leisure facilities. <br \/><br \/>The implementation of the abovementioned projects will contribute to further fruitful development of ski tourism, creating new workplaces, as well as a favorable investment environment. <br \/><br \/>The projects are implemented jointly by state and private sectors. The<\/p>\r\n<div class=\"article_ads\">&nbsp;<\/div>\r\n<p>latter is presented by &ldquo;Akhali Mitarbi&rdquo; Ltd., which is a part of GRDC holding. <br \/><br \/>The construction of the Kokhta and Mitarbi ski lifts will be funded by the government (48 million GEL) and the private sector (70 million GEL). It will be one of the biggest investments in ski tourism.<\/p>\r\n<p>&nbsp;<\/p>\r\n<p>The ski lifts of Kokhta and Mitarbi will be installed by a leading company in this field &ndash; Doppelmeyr. At the Kokhta mountain resort, the season will open on December 27th .<br \/><br \/>In Bakuriani, the additional attraction of a Toboggan, a two-rail mountain sledge, will be installed close to the first ski lift. Construction will be completed by the end of 2015.<br \/><br \/>Therefore, the Gudauri and Goderdzi ski resorts are also actively involved in the preparation processes. At the beginning of December, the season opening will be carried out at the Goderdzi ski resort and afterwards, at Gudauri and Bakuriani. <br \/><br \/>So those who decide to spend the winter holidays in Georgia are going to have an unforgettable time. So, if you have already made up your mind, hurry up and book your places.<\/p>","admin_com":"","tags":"","slug":"about-us\/news\/The-Mountain-Resorts-of-Georgia-Prepare-for-Winters-Hot-Season","insert_admin":"1","position":"0","lang":"5","visibility":"2","status":"0"},{"id":"121","idx":"106","uid":"","insert_ip":"","date":"1444319940","expiredate":"1445011140","module_idx":"2","type":"","title":"Prince Harry and Georgian businessman on the same tribune at Georgia vs. Namibia match","picture":"","hscode":"","sector_id":"","sub_sector_id":"","products":"","shelf_life":"","packaging":"","awards":"","event_desc":"","event_when":"","event_fee":"","event_website":"","videourl":"","short_description":"<p>On October 7, in Exeter, southwest England, Georgian National Rugby Team defeated Namibia in a World Cup game.<\/p>","long_description":"<p>On October 7, in Exeter, southwest England, Georgian National Rugby Team defeated Namibia in a World Cup game. It is noteworthy that Prince Harry from England&rsquo;s royal family attended the match and observed the tense game with great curiosity. Moreover, the camera has also captured Georgian businessman Levan Vasadze who was sitting in the same tribune along with the President of Georgian Rugby Union Gia Nijaradze and Givi Chichinadze, the Governor of Imereti (Georgia&rsquo;s western region).<\/p>","admin_com":"","tags":"","slug":"about-us\/news\/Prince-Harry-and-Georgian-businessman-on-the-same-tribune-at-Georgia-vs-Namibia-match","insert_admin":"1","position":"0","lang":"5","visibility":"2","status":"0"}]